menu = '''Главное меню
    1. Открыть справочник
    2. Добавить контакт
    3. Найти контакт
    4. Редактировать контакт
    5. Удалить контакт
    6. Сохранить справочник
    7. Выйти'''

choice_1 = 'Выберите действие: '
choice_2 = 'Такого действия нет!!! '

message_print = 'Справочник загружен!!!'
message_remove = 'Остались контакты !!!'

name = 'Введите ФИО: '
phone = 'Введите номер телефона: '
comment = 'Комментарий: '

find_word = 'Введите параметр поиска: '
find_message_1 = 'Возможно вы искали?'
find_message_2 = 'Список пуст!!'

delete_id = 'Введите Ид контакта, который надо удалить: '

download_directory = 'Сохраните справочник!!'

error_contact = 'Такого контакта нет'

update_id = 'Введите ИД контакта который будем изменять: '

exit_message = 'Еще увидимся!!'
